quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Какая библиотека отвечает за время?',
        'options': ['localtime', 'clock', 'Time', 'time'],
        'correct_option': 3
    },
    {
        'question': 'Какая функция выводит что-либо в консоль??',
        'options': ['write();', 'log();', 'out();', 'print();'],
        'correct_option': 3
    },
    {
        'question': 'Как правильно комментировать одну строку в Python?',
        'options': ['# Это комментарий', '// Это комментарий', '/* Это комментарий */', '<!-- Это комментарий -->'],
        'correct_option': 0
    },
    {
        'question': 'Какой оператор используется для "не равно" в Python?',
        'options': ['!=', '==', '<=', '>='],
        'correct_option': 0
    },
    {
        'question': 'Что по умолчанию служит концом инструкции в Python?',
        'options': ['конец строки', 'запятая', 'точка', 'точка с запятой'],
        'correct_option': 0
    },
    {
        'question': 'Какие из представленных литералов чисел относятся к типу float?',
        'options': ['1.7+4.3j', ' 5.0', '88', '-.4'],
        'correct_option': 1
    },
    {
        'question': 'Что будет выведено на экран в результате выполнения инструкции print(5**(5 - 2))?',
        'options': ['15', '125', '45.0', 'ошибка'],
        'correct_option': 1
    }

]
